<template>
  <div class="content">
    <div class="title">Инфинитив и герундий: формы и употребление</div>
    <div class="text">
      Как различать инфинитив и герундий в английском, в каких случаях они
      используются, что на это влияет, какие группы глаголов существуют и как во
      всем этом разобраться. И возможно ли?<br />

      Конечно, возможно. Хотя тема инфинитива и герундия — одна из наиболее
      обширных в английском языке и имеет множество нюансов, не нужно ее
      бояться. Последовательное изучение и разбор примеров помогут усвоить ее и
      безошибочно употреблять обе формы.<br />

      Охватить все детали этой темы — задача непростая. Сложность заключается в
      том, что для выбора verb ing or infinitive правило не может быть
      однозначно установлено. Выбор может отличаться в каждом отдельном случае,
      и определяется он глаголом, от которого зависят инфинитив / герундий.
      Поэтому особое внимание стоит уделить разбору конкретных предложений,
      чтобы лучше запомнить, что с чем употребляется. Но начнем все-таки с общей
      теории: что из себя представляет каждая из двух форм.<br />
    </div>
    <div class="subtitle">Инфинитив</div>
    <div class="text">
      Инфинитив для носителей русского языка привычен. Это глагольная форма,
      которая не изменяется по лицам и числам. Он несет в себе общее значение
      ситуации, поэтому в словаре зафиксирована именно эта глагольная форма.
      Например, глагол to run — бежать. Узнать форму инфинитива можно по частице
      to, которая стоит перед глаголом.<br />

      Инфинитив в английском языке схож с русским и часто переводится идентичным
      образом.<br />
      <li class="list_item">
        I want to become an actor — Я хочу стать актером.
      </li>
    </div>
    <div class="subtitle">Герундий</div>
    <div class="text">
      С появлением герундия начинаются сложности. В русском языке эквивалента
      герундию не существует. В зависимости от предложения он может переводиться
      различными способами: отглагольным существительным, инфинитивом,
      деепричастием или подчиненным предложением.

      <li class="list_item">
        I enjoy listening to music — Мне нравится слушать музыку / Я получаю
        наслаждение, слушая музыку / Я получаю наслаждение от прослушивания
        музыки
      </li>

      Образуется герундий от основы глагола с помощью добавления окончания -ing.
      Форма на -ing может обозначать также причастие: например, «a crying child»
      (плачущий ребенок). Однако причастие отличается от герундия по своему
      значению, кроме того, оно непосредственно связано с существительным и
      зависит от него.<br />

      Герундий занимает промежуточную позицию между существительным и глаголом и
      объединяет в себе черты этих частей речи. По значению он близок
      существительному, в котором заключена идея процесса действия (reading —
      чтение, walking — прогулка, хождение). Однако герундий не может
      употребляется с артиклем и не имеет формы множественного числа.<br />

      <li class="list_item">
        Swimming is good for your health — Плавание полезно для твоего здоровья.
      </li>
      Эта форма имеет также глагольные черты. Инфинитив и герундий в английском
      похожи тем, что оба являются безличными: они не изменяются по лицу и
      числу. С другой стороны, они могут изменяться по времени и, например,
      иметь формы перфекта (to have done — инфинитив / having done — герундий).

      <li class="list_item">
        After having lived in one room for a year we can completely trust each
        other — После того, как мы прожили год в одной комнате, мы можем
        полностью друг другу доверять.
      </li>

      Сближает герундий и инфинитив в английском языке также то, что они могут
      занимать одну позицию в предложении. Тогда и возникает вопрос: какую из
      форм выбрать? Ситуация осложняется тем, что в английском языке нет
      конкретного правила, которое однозначно определяло бы, какая форма должна
      использоваться.<br />

      Выбор зависит от глагола, который предшествует форме инфинитива или
      герундия. К примеру, для глагола allow: инфинитив или герундий? Это
      определяется самим глаголом allow (позволять), который здесь подчиняет
      себе следующее слово. Именно предшествующий глагол служит индикатором
      выбора, и чтобы знать, какую форму ставить, нужно помнить его требования.
      Так в английском выделяются две группы глаголов: те, которые употребляются
      с инфинитивом, и те, после которых следует герундий.<br />
    </div>
    <div class="subtitle">Разнообразие форм и конструкций</div>
    <div class="text">
      Инфинитив и герундий могут встречаться не только в таком виде, как мы их
      рассмотрели. Они могут употребляться в перфектной форме или стоять в
      пассиве. Страдательный залог образуется добавлением глагола to be, который
      принимает на себя форму инфинитива или герундия. А смысловой глагол в
      таком случае употребляется в третьей форме. Например: to be done / being
      done (быть сделанным).

      <li class="list_item">
        She refused to be interviewed — Она отказалась давать интервью.
      </li>
      <li class="list_item">
        I didn't want to risk being destroyed — Я не хотел идти на риск быть
        уничтоженным.
      </li>

      Частица to не всегда может указывать на употребление формы инфинитива: она
      может быть частью предыдущего глагола. Например, при look forward to может
      быть только форма герундия, несмотря на наличие to. Частица здесь
      принадлежит глагольной конструкции look forward to (ожидать с нетерпением,
      предвкушать) и неотделима от нее.

      <li class="list_item">
        I look forward to hearing from you soon — Надеюсь скоро получить от тебя
        новости.
      </li>
      Аналогичная ситуация с конструкцией be / get used to. Частица относится к
      самой конструкции и не служит средством присоединения инфинитива. Оба
      варианта — to be used to (иметь привычку) и to get used to (привыкнуть,
      приобрести привычку) — требуют после себя герундия.
      <li class="list_item">
        They are used to working together — Они привыкли работать вместе.
      </li>
      <li class="list_item">
        We'll get used to living in this city — Мы привыкнем к жизни в этом
        городе.
      </li>
      Но не стоит путать эти конструкции с выражением used to в значении
      ситуации, которая была привычна в прошлом, но не происходит в настоящем.
      Здесь перед used не ставится глагол to be, а за выражением следует
      инфинитив.
      <ul class="list">
        <div class="list_item">
          I used to wake up at 6 a.m., but now I don’t need to do it — Раньше я
          вставал в 6 утра, но сейчас мне не нужно этого делать.
        </div>
      </ul>
      Конструкции с инфинитивом и герундием могут употребляться в отрицании. При
      этом отрицание может относиться не только ко всей ситуации в целом (I
      don't want to become an actor — Я не хочу стать актером). Отрицание может
      действовать непосредственно на герундий или инфинитив. В таком случае
      частица not должна стоять после первого глагола. Тогда для герундия схема
      отрицания выглядит как not V-ing, а для инфинитива — not to V:
      <ul class="list">
        <li class="list_item">
          I hope not to be like that — Я надеюсь, что таким не буду.
        </li>
        <li class="list_item">
          I enjoy not being famous — Мне нравится не быть знаменитым.
        </li>
      </ul>

      Альтернативой конструкциям с инфинитивом и герундием могут выступать
      двусоставные предложения со связкой that. Они могут передавать тот же
      смысл, но использовать для этого структуру с подчиненным предложением.
      Чаще всего в такой конструкции выступают глаголы речи или суждений, такие
      как deny (отрицать), suggest (предлагать), admit (допускать).

      <ul class="list">
        <li class="list_item">
          At first they denied that they had said such words / At first they
          denied saying such words — Сперва они отрицали, что говорили такие
          слова.
        </li>
      </ul>
    </div>
  </div>
</template>
