<template>
  <div class="content">
    <h1 class="title">
      Past Simple: правила и примеры​ употребления, способы образования,
      секреты, исключения и подводные камни
    </h1>
    <div class="text">
      Past Simple называют простым прошедшим временем, однако для многих это
      такой темный лес, что они не знают, как к нему подступиться. Уверены, это
      не о вас, но все же… Зачем нам (а точнее, англичанам) нужен этот Past
      Simple Tense? Past Simple (иначе, Past Indefinite) произносится как паст
      симпл. Правила Past simple несложные: скоро мы узнаем, когда употребляется
      past simple, как образуется паст симпл, почему обязательно использовать
      именно Past Simple, правила и примеры функционирования этого времени в
      тексте. Представьте ситуацию: вот вы рассказываете знакомому, что делали
      прошлым летом. И туда ездили, и там были, и то видели. А как все это
      рассказать по-английски? Не строить же баррикады из перфектных форм,
      правда? Вот для этого и нужно время Past Simple.
    </div>
    <div class="subtitle">
      Past Simple Tense: правила употребления в английском языке
    </div>
    <div class="text">
      Итак, давайте в деталях рассмотрим Past Simple - когда употребляется это
      время?
      <ul class="list">
        <li class="list_item">
          Действие, которое вы (или кто-то другой) регулярно совершали в
          прошлом. Насколько часто - неважно. Хоть каждую минуту, хоть раз в
          тысячелетие. Главное, что действие время от времени повторялось в
          прошлом. Вот как здесь: He often visited us (часто навещал), when we
          lived there.
        </li>

        <li class="list_item">
          Постоянный признак предмета или характеристика человека в прошлом.
          Каким был этот предмет или человек когда-то? Например: Jane looked
          much better (выглядела намного лучше), when I saw her last time.
        </li>
        <li class="list_item">
          Цепь последовательных действий в прошлом. Часто встречается в сказках
          типа “бабка за дедку, дедка за репку”, т.е. где шаг за шагом
          описываются действия персонажей. Цепь простых действий встречается и в
          нашей обычной жизни. Взгляните: I entered the hall, switched on the
          light, opened the wardrobe, and then quickly closed it. Вошел, включил
          свет, открыл шкаф - это последовательные действия, между ними прошло
          очень мало времени. Нет смысла усложнять предложение и пытаться
          передать эту цепочку действий каким-то другим способом, кроме Past
          Simple.
        </li>
        <li class="list_item">
          Однократное действие в прошлом. Да-да, это как раз про то, как вы 10
          лет назад съездили на курорт, а теперь делитесь воспоминаниями. То,
          что однажды произошло некоторое время назад (неважно, вчера или 140
          лет назад) передается через Past Simple.
        </li>
      </ul>
    </div>
    <div class="subtitle">Подводный камень:</div>
    <div class="text">
      Как быть с культурным наследием? Например, Шекспир написал в таком-то году
      такое-то произведение. Мы ведь пользуемся результатами труда Шекспира,
      причем делаем это сейчас - в этом случае Past Simple часто путают с
      present perfect, который как раз и описывает результат в настоящем. Однако
      правило паст симпл здесь довольно жесткое. Любое изобретение, любое
      некогда написанное произведение - это факт в прошлом. А факты, особенно с
      указанием точной даты, - сфера группы времен Simple.
    </div>
    <div class="subtitle">Past Simple: образование</div>
    <div class="text">
      Как образуется Past Simple? А очень просто. Не зря же его называют
      простым. Past Simple, образование: V2 (вторая форма глагола). Вы помните
      про то, что все глаголы английского языка можно разделить на правильные и
      неправильные?
    </div>
    <div class="subtitle">
      Past Simple: правила образования простого прошедшего неправильных глаголов
    </div>
    <div class="text">
      Неправильные глаголы живут своей жизнью: у них есть три формы, все три
      нужно знать наизусть. Чтобы получить Past Simple, мы используем вторую
      форму (V2) неправильного глагола.
    </div>
    <div class="subtitle">Например:</div>
    <div class="text">
      Buy - bought - bought Read - read - read Cut - cut - cut Lie - lay - lain
      Список неправильных глаголов есть в конце любого словаря или справочника.
      В идеале из справочника этот список должен перекочевать в голову. К
      счастью, неправильных глаголов не так много. Относительно. А вот все
      остальные глаголы, которых нет в списке неправильных, называются
      правильными. И с ними все очень легко. Past Simple: правила образования
      простого прошедшего правильных глаголов Правильные глаголы в Past Simple
      приобретают окончание -ed или -d. Его мы прибавляем к основе инфинитива.
    </div>
    <div class="subtitle">Например:</div>
    <div class="text">
      To kick - he kicked (пинать - он пинал) To look - he looked (смотреть - он
      смотрел) Если основа инфинитива уже заканчивается на e, то прибавляется
      только -d: To dance - he danced (танцевать - он танцевал) To invite - he
      invited (приглашать - он пригласил) Вот и все! Все-таки не зря Past Simple
      назвали простым, правда? Но есть и кое-какие подводные камни.
    </div>
    <div class="subtitle">Нюанс № 1</div>
    <div class="text">
      Если слово заканчивается на букву y, то ее нужно поменять на i и только
      затем добавлять окончание -ed. Эту манипуляцию мы делаем только и
      исключительно тогда, когда y предшествует согласная.
    </div>
    <div class="subtitle">Сравните:</div>
    <div class="text">
      To fly - he flied To obey - he obeyed В случае с obey перед y - гласная e.
      Что ж, ставим окончание -ed и радуемся, что ничего менять не надо!
    </div>
    <div class="subtitle">Нюанс № 2</div>
    <div class="text">
      Понравилось? Тогда вот вам второй нюанс. Если глагол заканчивается на
      комбинацию: краткий гласный звук + согласная буква, то согласная, как
      правило, удваивается. To plan - he planned Это нужно для того, чтобы
      сохранить закрытый слог. Ведь если в слове planned мы не удвоим n, то
      получится открытый слог, a в открытом слоге читается иначе. В итоге
      получится совсем другое слово! Поэтому не забываем удваивать согласную
      там, где нужно. А вот посмотрите на эти примеры: To fear - he feared To
      look - he looked Здесь ничего удваивать не нужно, ведь перед согласными
      стоят вовсе не краткие гласные, на их произнесение ничего не может
      повлиять. В британском английским всегда удваивается и l в конце слова: To
      quarrel - we quarrelled А вот в американском английском такой метаморфозы
      не происходит. To quarrel - we quarreled Как правильно читать глаголы с
      окончанием -ed Если поставить глагол в Past Simple сравнительно легко, то
      прочитать иногда бывает - не очень.
    </div>
    <img src="../../assets/grammar/past-simple-1.png" class="image" />
    <div class="text">
      Старайтесь не пренебрегать правильным произношением, иначе иностранцу
      будет очень трудно вас понять.
    </div>
    <div class="subtitle">А что с вопросами и отрицаниями?</div>
    <div class="text">
      Чтобы составить вопрос или отрицание, нам понадобится вспомогательный
      глагол do. Без него, увы, ни вопроса не сделать, ни отрицания не
      сформировать. Вспомогательный глагол do в Past Simple будет иметь форму
      did. В отрицательном предложении did ставится после подлежащего и
      приобретает негативную частицу not.
    </div>
    <div class="subtitle">Отрицание в Past Simple: правило образования</div>
    <div class="text">
      Подлежащее + did not + сказуемое (инфинитив) Tom did not eat porridge. Did
      not = didn’t. Didn’t - это сокращенная форма did not. В устной речи вы
      скорее всего услышите именно эту форму. Tom did not eat porridge = Tom
      didn’t eat porridge. Mark did not come yesterday = Mark didn’t come
      yesterday
    </div>
    <div class="subtitle">Вопрос в Past Simple: правило образования</div>
    <div class="text">
      В вопросе did будет вставать на первую позицию. Схема общего вопроса в
      past simple будет такая: DID + подлежащее + сказуемое (инфинитив)? Did Tom
      eat porridge? Ответ на этот вопрос может быть полным, но обычно бывает
      кратким: - Yes, he did. / No, he didn’t.
    </div>
    <img src="../../assets/grammar/past-simple-2.png" class="image" />
    <div class="subtitle">Подводный камень:</div>
    <div class="text">
      Очень частая ошибка при образовании вопросов и отрицаний в Past Simple:
      употребление V2 вместо инфинитива. Мы хорошо уяснили, как образуется паст
      симпл - с помощью окончания -ed (для правильных глаголов) и V2 для
      неправильных. Уяснив это, мы начинаем ставить вторую форму глагола
      повсюду, а ведь в вопросе и отрицании это лишнее! Вспомогательный глагол
      do уже принял на себя функции past simple и превратился в did (помним, что
      do - это неправильный глагол: do-did-done. Соответственно, его V2 - did).
      Did УЖЕ показывает прошедшее простое время. Делать еще какие-то
      дополнительные манипуляции со смысловым глаголом (сказуемым) просто не
      нужно! Did уже обо всем позаботился!
    </div>
    <div class="subtitle">Специальные вопросы</div>
    <div class="text">
      Это вопросы, которые начинаются со специального вопросительного слова.
      Вопросительные слова: What что? Where где? Who кто? Why почему? When
      когда? Whom кому? How как? Специальные вопросы не так сложны, как кажутся.
      Если схема простого вопроса выглядит так: DID + подлежащее + сказуемое
      (инфинитив)? То схема специального вопроса выглядит вот так:
      Вопросительное слово + DID + подлежащее + сказуемое (инфинитив)? Мы просто
      ставим на нулевую позицию вопросительное слово - и все! Остальной порядок
      слов остается неизменным. Английский язык не был бы английским, не будь и
      здесь какого-нибудь исключения. Оно есть. С вопросительными словами Who
      (кто?) и What? (что?), если мы задаем вопрос к подлежащему, такая схема не
      работает. Правда, она еще проще. Мы просто ставим who или what на место
      подлежащего! И все! Сказуемое при этом остается в past simple. На практике
      это выглядит так: Mary ate ice-cream yesterday. (Мэри вчера ела
      мороженое.) Who ate ice-cream yesterday? (Кто вчера ел мороженое?) Важно:
      такая схема с who работает только тогда, когда мы задаем вопрос к
      подлежащему. Если же мы задаем вопрос к прямому дополнению, то схема будет
      стандартной. Сравните: Tom saw Mary two days ago. Who saw Mary two days
      ago? Вопрос задан к подлежащему (Tom). Who стоит на первой позиции,
      вспомогательный глагол не требуется. Поехали дальше. Давайте сначала
      зададим общий вопрос (ответом на который будет “да” или “нет”): Did Tom
      see Mary two days ago? (ставим did на первое место) А теперь специальный
      вопрос с who, но только не к подлежащему, а к прямому дополнению (Mary):
      Who did Tom see two days ago? Поскольку вопрос мы задаем не к подлежащему,
      значит, как и любое вопросительное слово, who встает на нулевую позицию,
      на первой позиции остается did и далее по стандартной схеме.)
    </div>
    <div class="subtitle">Маркеры Past Simple</div>
    <div class="text">
      Маркеры - это наши помощники, слова-подсказки, которые помогают нам
      понять, когда нам нужно время Past Simple. Если мы замечаем такое слово в
      предложении, это очень красноречивый намек на то, что нужно употребить
      простое прошедшее время.
    </div>
    <img src="../../assets/grammar/past-simple-3.png" class="image" />
    <div class="text">
      Хорошо, маркеры мы знаем, а куда их ставить в предложении? Ведь структура
      английского предложения довольна жесткая… Маркеры, в которых содержатся
      слова last, every, ago, как правило, ставятся на последнее место в
      предложении: I met Helen three months ago. Emma spent three weeks in Paris
      last year. Маркеры often, never, usually, seldom, always и подобные обычно
      стоят перед глаголом: I never saw you working. Tom and I always spent
      holidays together. Важно: Если в качестве сказуемого функционирует не
      глагол действия, а глагол to be, то эти маркеры ставятся после него: John
      was often tired. Маркер yesterday может встретиться и в начале
      предложения, и в конце: Yesterday I bought a new fur coat. I bought a new
      fur coat yesterday. А вот sometimes вообще может встать, куда захочет. А
      точнее, куда вы захотите: I went to Paris sometimes, but always felt
      uncomfortable there. Sometimes I went to Paris, but always felt
      uncomfortable there. Что делать, если в предложении нет маркеров? Как мы
      работаем с английским предложением? В первую очередь смотрим на маркеры.
      Если у вас есть маркер ago или last, то уже на этапе первого знакомства с
      предложением, даже не переводя его, вы понимаете, какое время нужно
      использовать: Past Simple. Если же очевидных маркеров в предложении нет,
      то мы переходим к следующему этапу: переводим предложение. И тут вы можете
      заметить кое-какие подсказки.
    </div>
  </div>
</template>

<script setup>
import styles from "../../modules/css/grammar.css";
</script>
