<template>
  <div class="content">
    <h1 class="title">
      Правила использования Present Simple Tense в английском языке
    </h1>
    <div class="text">
      Present Simple Tense – это грамматическое время, которое считается одним
      из самых простых в понимании, поскольку, настоящее простое время
      существует во всех языках. В славянских языках так точно. Если вы читаете
      эту статью, это значит, что вы только начинаете учить английский язык
      (повторяете забытый материал). Так вот, я постараюсь описать все как можно
      проще и доступнее, с примерами. Обратите внимание, что в этой статье мы
      остановимся не на формах глагола to be (быть), а на использовании простого
      настоящего времени вообще. Начнем с того, что Present Simple это простое
      непродолжительное время глагола в английском языке.
    </div>
    <h4 class="subtitle">Употребление Present Simple Tense</h4>
    <div class="text">
      Простое настоящее время мы используем, в следующих случаях:<br />
      1. Когда речь идет о чем-то в общем, а также об общеизвестных фактах
      <br />
      Например:

      <ul class="list">
        <li class="list_item">
          The Queen of England lives in Buckingham Palace.
        </li>
        <li class="list_item">Королева Англии живет в Букингемском Дворце.</li>
        <li class="list_item">Nurses look after patients in hospitals.</li>
        <li class="list_item">
          Медсестры ухаживают за больными в поликлиниках.
        </li>
        <li class="list_item">The earth goes around the sun.</li>
        <li class="list_item">Земля вертится вокруг Солнца.</li>
        <li class="list_item">A dog has four legs.</li>
        <li class="list_item">У собаки четыре лапы.</li>
      </ul>
    </div>
    <div class="text">
      2. Говоря о повторяющихся, обычных действиях в настоящем времени,
      происходящих вообще, а не в момент речи, а также для будущих событий
      (расписания)
      <br />
      Например:

      <ul class="list">
        <div class="list_item">
          <li class="list_item">The train to Prague leaves every hour.</li>
          <li class="list_item">Поезд в Прагу отправляется каждый час.</li>
          <li class="list_item">
            Jane sleeps eight hours every night during the week.
          </li>
          <li class="list_item">
            Джейн спит по восемь часов каждую ночь на протяжении недели.
          </li>
          <li class="list_item">
            The coffeehouse opens at 9.00 in the morning.
          </li>
          <li class="list_item">Кофейня открывается в 9.00 утра.</li>
        </div>
      </ul>

      Таким образом, если вы хотите сказать, что-то происходит каждый день,
      постоянно, регулярно или это общеизвестный факт, используйте простое
      настоящее время.
    </div>
    <h4 class="subtitle">Как образовывается Present Simple Tense</h4>
    <div class="text">
      Все просто: для образования утвердительного предложения нужно взять
      английский глагол без частицы to, либо же добавить к нему окончание –s/es
      для 3 лица единственного числа, т.е. он, она, оно – he, she, it; и
      поставить его после субъекта (того, кто исполняет действие).<br />

      Смотрите пример: <br />

      I drive to work every day. – Я еду на машине на работу каждый день.<br />

      He drives to another city every day. – Каждый день он ездит в другой
      город.<br />

      Видите, в первом предложении мы просто взяли глагол (инфинитив без частицы
      to), а во втором добавили к нему окончание –s, потому что субъект
      исполнения действия «he – он».<br />

      Что касается отрицательных и вопросительных предложений, то здесь
      появляются глаголы-помощники или вспомогательные глаголы, как их часто
      называют (auxiliary verbs): do и does + not (если это отрицание).<br />

      В вопросительных предложениях мы ставим do или does в начало предложения.
      Does используется для he, she, it. Для всех остальных – do.<br />

      Плюс пропадает окончание –s/es в 3 лице ед.числа.<br />

      Например: Do they go to school at weekends? – Они ходят в школу по
      выходным?<br />

      Do you need a dictionary? – Тебе нужен словарь?<br />

      Does he like pizza? – Ему нравится пицца?<br />

      Чтобы ответить на вопрос грамматически правильно, запомните: отвечаем так,
      как спрашивают.<br />

      Если вопрос начинался со слова Do you…?, то и отвечайте «Yes, I do.» или
      «No, I don’t» (=do not). Если вопрос начинается с Does he/she/it…? – тоже
      отвечайте «Yes, he/she/it does.» или «No, he/she/it doesn’t.» (=does
      not)<br />

      Но если вопрос начинается со слов who, when, where, why, which или how,
      короткий ответ типа «Да» или «Нет» уже не подойдет.<br />
    </div>
    <img src="../../assets/grammar/present-simple.jpg" class="table" />
    <div class="text">
      Для того чтобы сделать предложение отрицательным, необходимо добавить
      частицу not к вспомогательному глаголу.<br />

      Порядок слов будет следующим: субъект/объект + do/does not + основной
      глагол + все остальное.<br />

      Например:<br />

      I don’t like this T-shirt. – Мне не нравится эта футболка.<br />

      She doesn’t go with us to the cinema. – Она не идет с нами в кино.<br />

      Примечание:<br />

      don’t = do not<br />
      doesn’t = does not<br />

      Чаще используются короткие формы (don’t, doesn’t).<br />
      В английских пословицах и высказываниях время Present Simple самое
      популярное. Вот несколько примеров народной мудрости:<br />

      <ul class="list">
        <li class="list_item">
          A new broom sweeps clean. — Новая метла по-новому метёт.
        </li>
        <li class="list_item">
          Oil and water don’t mix. — Воду с маслом не перемешивают./ Гусь свинье
          не товарищ.
        </li>
        <li class="list_item">
          It never rains but it pours. — Дождь никогда не идёт по капле, а
          обрушивается ливнем./ Беда не приходит одна.
        </li>
        <li class="list_item">
          Still waters run deep. — Тихие воды глубоко текут./ В тихом омуте
          черти водятся.
        </li>
        <li class="list_item">
          Practice makes perfect. — Практика — путь к совершенству./ Повторение
          — мать учения.
        </li>
      </ul>
    </div>

    <div class="text">
      Будет очень круто, если вы выучите парочку таких выражений на английском и
      будете использовать в своей речи.<br />

      Если у вас появились вопросы по поводу использования и формирования
      времени Present Simple в английском языке, пишите в комментариях – будем
      разбираться!<br />

      До новых встреч!<br />
    </div>
  </div>
</template>

<script setup>
import styles from "../../modules/css/grammar.css";
</script>
